<?php

if($textmassage=="help" or $textmassage=="راهنما"){
    if ($tc == 'group' | $tc == 'supergroup'){  
        bot('sendmessage',[
            'chat_id'=>$chat_id,
            'text'=>"💢 به بخش دریافت دستورات خوش آمدید.
            ━┅┄┄┄┄┄┄┄┄┄┄┄┄┄
            💥لطفا بخش مورد نظر خورد را انتخاب کنید

            ⚠️ برای دیدن دستورات قفلی و مدیریتی شما باید حتما مدیر ربات باشید و کابران عادی اجازه ورود به این بخش را ندارند",
            'reply_markup'=>json_encode([
                'inline_keyboard'=>[
                    [
                        ['text'=>"⧼ مدیریت ⧽",'callback_data'=>"managefa"]
                    ],
                    [
                        ['text'=>"⧼ عمومی ⧽",'callback_data'=>"allfa"]
                    ],
                    [
                        ['text'=>"⧼ قفل ها ⧽",'callback_data'=>"lockfa"]
                    ],
                    [
                        ['text'=>"خروج",'callback_data'=>'exit']
                    ],
                ]
            ])
        ]);
    }
}
elseif($data=="help"){
    bot('editmessagetext',[
        'chat_id'=>$chatid,
        'message_id'=>$messageid,
        'text'=>"💢 به بخش دریافت دستورات خوش آمدید.
        ━┅┄┄┄┄┄┄┄┄┄┄┄┄┄
        💥لطفا بخش مورد نظر خورد را انتخاب کنید

        ⚠️ برای دیدن دستورات قفلی و مدیریتی شما باید حتما مدیر ربات باشید و کابران عادی اجازه ورود به این بخش را ندارند",
        'reply_markup'=>json_encode([
            'inline_keyboard'=>[
                [
                    ['text'=>"⧼ مدیریت ⧽",'callback_data'=>"managefa"]
                ],
                [
                    ['text'=>"⧼ عمومی ⧽",'callback_data'=>"allfa"]
                ],
                [
                    ['text'=>"⧼ قفل ها ⧽",'callback_data'=>"lockfa"]
                ],
                [
                    ['text'=>"خروج",'callback_data'=>'exit']
                ],
            ]
        ])
    );
}
elseif($data=="managefa"){
    if ($statusq == 'creator' or $statusq == 'administrator' or in_array($fromid,$Dev) ){
        bot('editmessagetext',[
            'chat_id'=>$chatid,
            'message_id'=>$messageid,
            'text'=>"💢 بخش دستورات مدیریتی :
            ━┅┄┄┄┄┄┄┄┄┄┄┄┄┄
            🛡پنل
            💭دریافت پنل تنظیمات و پنل مدیریت گروه

            🛡تنظیمات
            💭دریافت تنظیمات گروه به صورت متنی

            🛡ادمین [ریپلای]
            💭ادمین کرد فرد مورد نظر

            🛡حذف ادمین [ریپلای]
            💭تنزل مقام فرد مورد نظر

            🛡لیست مدیران
            💭دریافت لیست ادمین های گروه

            🛡سنجاق [ریپلای]
            💭سنحاق کردن پیام مورد نظر توسط ربات

            🛡حذف سنجاق
            💭حذف سنجاق پیام سنجاق شده

            🛡اخراج
            💭اخراج فرد مورد نظر از گروه

            🛡حذف [ریپلای]
            💭حذف پیام مورد نظر

            🛡پاکسازی [1-200]
            💭پاک کردن پیام های اخیر گروه

            🛡تنظیم نام [نام]
            💭تنظیم نام گروه

            🛡تنظیم اطلاعات [متن]
            💭تنظیم اطلاعات گروه

            🛡حذف عکس
            💭حذف عکس گروه

            🛡تنظیم عکس [ریپلای]
            💭تنظیم عکس گروه

            🛡اعتبار
            💭دریافت میزان شارژ گروه

            🛡اتوماتیک فعال
            💭فعال کردن قفل ها به صورت خودکار و مدیریت خود کار گروه

            🛡قفل گروه
            💭ساکت کردن همه گروه

            🛡بازکردن گروه
            💭غیر فعال کردن سکوت گروه

            🛡خوش آمدگویی [فعال - غیرفعال]
            💭روشن . خاموش کردن خوش آمدگویی گروه

            🛡تنظیم خوش آمدگویی [متن]
            💭تنظیم پیام خوش آمد

            🛡سکوت
            💭افزودن فرد به لیست سکوت گروه

            🛡سکوت [دقیقه]
            💭افزودن فرد به لیست سکوت گروه به صورت زمان داره

            🛡حذف سکوت
            💭خارج کردن فرد از لیست سکوت گروه

            🛡لیست سکوت
            💭دریافت لیست سکوت گروه

            🛡پاکسازی لیست سکوت
            💭 پاک کردن لیست سکوت گروه

            🛡درخواست شارژ
            💭درخواست تمدید شارژ برای گروه

            🛡فیلترکردن [کلمه]
            💭افزودن کلمه به لیست کلمات فیلترشده

            🛡حذف فیلتر [کلمه]
            💭حذف کلمه از لیست کلمات فیلتر شده

            🛡لیست فیلتر
            💭دریافت لیست کلمات فیلتر شد

            🛡پاکسازی لیست فیلتر
            💭پاک کردن تمام کلمات درون لیست فیلتر

            🛡تنظیمات اولیه
            💭ریستارت کردن تنظیمات گروه به حالت اولیه

            🛡دعوت [روشن | خاموش]
            💭روشن و خاموش کردن اد اجباری در گروه

            🛡تنظیم دعوت [عدد]
            💭تنظیم مقدار کاربری که یک فرد باید دعوت کند تا بتواند در گروه چت کند

            🛡تنظیم اخطار [عدد]
            💭 تنظیم حداکثر اخطار برای کاربر

            🛡اخطار [ریپلای]
            💭اخطار دادن به کاربر مورد نظر

            🛡حذف اخطار [ریپلای]
            💭پاک کردن تمام اخطار های کاربر مورد نظر

            🛡اطلاعات اخطار [ریپلای]
            💭به دست اوردن تعداد اخطار های کاربر

            🛡تنظیم قوانین [متن]
            💭تنظیم قوانین گروه

            🛡بیصدا همه [دقیقه]
            💭سکوت همه به صورت زمان دار

            🛡قفل کانال [روشن | خاموش]
            💭روشن و خاموش کردن قفل کانال

            🛡تنظیم کانال [@یوزرنیم کانال]
            💭 قفل کردن ربات روی کانال تنظیم شد

            🛡سختگیرانه ربات [روشن | خاموش]
            💭 روشن و خاموش کردن حالت سختگیرانه اضافه کردن ربات

            🛡سختگیرانه اخطار [روشن | خاموش]
            💭 روشن و خاموش کردن حالت سختگیرانه اخراج کاربر پس از رسیدن به حداکثر اخطار

            🛡پاکسازی
            💭 پاکسازی پیام های اخیر گروه تا حد ممکن

            میتوانید در متن خوش آمد و قوانین برای گرفتن مشخصات از پارامتر های زیر استفاده کنید
            gpname = دریافت نام گروه
            username = دریافت یوزرنیم فرد
            time = دریافت ساعت وتاریخ
            ⁪",
            'reply_markup'=>json_encode([
                'inline_keyboard'=>[
                    [
                        ['text'=>"برگشت ≫",'callback_data'=>'help']
                    ],
                ]
            ])
        ]);
    }
    else{
        bot('answerCallbackQuery',[
            'callback_query_id'=>$membercall,
            'text'=>"شما مدیر ربات نیستید ⚠️",
        ]);
    }
}
elseif($data=="allfa"){
    bot('editmessagetext',[
        'chat_id'=>$chatid,
        'message_id'=>$messageid,
        'text'=>"💢 بخش دستورات عمومی :
        ━┅┄┄┄┄┄┄┄┄┄┄┄┄┄
        🛡قوانین
        💭دریافت قوانین گروه

        🛡لینک
        💭دریافت لینک گروه

        🛡ساعت
        💭دریافت تاریخ و ساعت

        🛡ایدی
        💭دریافت اطلاعات خودتان

        🛡ایدی [ریپلای]
        💭دریافت اطلاعات فرد

        🛡من
        💭دریافت اطلاعات شما به همراه مقام شما در ربات

        🛡اطلاعات فرد [ریپلای| ایدی]
        💭دریافت اطلاعات فرد مورد نظر

        🛡پینگ
        💭اطمینان حاصل کردن از انلاینی ربات

        🛡درخواست پشتیبانی
        💭در صورت وجود مشکل با ارسال این دستور پشتیبانی به گروه شما اعزام میشود

        🛡ریپورت [ریپلای]
        💭ارسال گزارش برای مدیر گروه

        🛡عکس پروفایل [عدد]
        💭دریافت عکس پروفایل شما به عدد
        ⁪",
        'reply_markup'=>json_encode([
            'inline_keyboard'=>[
			    [
				    ['text'=>"برگشت ≫",'callback_data'=>'help']
			    ],
            ]
        ])
    ]);
}	
elseif($data=="lockfa"){
    if ($statusq == 'creator' or $statusq == 'administrator' or in_array($fromid,$Dev) ){
        bot('editmessagetext',[
            'chat_id'=>$chatid,
            'message_id'=>$messageid,
            'text'=>"💢 بخش دستورات قفلی :
            ━┅┄┄┄┄┄┄┄┄┄┄┄┄┄
            🛡قفل لینک | تگ | یوزرنیم | متن | ویرایش | ربات | فحش | گیف | عکس | ویدیو | آهنگ | ویس | استیکر | مخاطب | فوروارد | مکان | فایل | بازی | پیام ویدیویی | ریپلای | دستورات | خدمات
            🛡بازکردن لینک
            ━┅┄┄┄┄┄┄┄┄┄┄┄┄┄
            🛡قفل خودکار روشن
            🛡قفل خودکار خاموش
            🛡تنظیم قفل خودکار [زمان پایان زمان شروع]

            💥زمان را باید با فرمت صحیح استفاده کنید مثال :
            تنظیم قفل خودکار 13:36 19:05
            ━┅┄┄┄┄┄┄┄┄┄┄┄┄┄
            🛡قفل کاراکتر
            🛡بازکردن کاراکتر
            🛡تنظیم کاراکتر [حداقل کاراکتر حداکثر کاراکتر]

            💥باید حتما به عدد وارد کنید مثال :
            تنظیم کاراکتر 10 320
            ━┅┄┄┄┄┄┄┄┄┄┄┄┄┄
            ✨بازکردن و قفل کردن هم از طریق پنل و هم از طریق دستور ممکن است

            مثال :
            قفل لینک
            بازکردن لینک
            ⁪",
            'reply_markup'=>json_encode([
                'inline_keyboard'=>[
			        [
			            ['text'=>"برگشت ≫",'callback_data'=>'help']
			        ],
                ]
            ])
        ]);
    }
    else{
	    bot('answerCallbackQuery',[
            'callback_query_id'=>$membercall,
            'text'=>"شما مدیر ربات نیستید ⚠️",
        ]);
    }
}	

?>
